In [2]:
import pandas as pd

customers = pd.read_csv("../01_ecommerce_ops_analytics/data/raw/customers.csv")

customers.head()

,customer_id,first_name,last_name,email,phone,city,state,postal_code,country,signup_date,last_order_date,total_orders,total_spent,marketing_opt_in,segment
0,1,Tiana,Harris,tiana.harris1@example.com,(959) 481-5012,Charlotte,NC,43434,USA,2023-11-24,2024-08-29,3,467.44,True,Active
1,2,Marcus,Moore,marcus.moore2@example.com,(438) 717-1434,Phoenix,FL,84987,USA,2022-08-14,2023-01-03,1,194.53,True,Churn Risk
2,3,Aaliyah,Jackson,aaliyah.jackson3@example.com,(484) 359-4527,Chicago,TX,42156,USA,2023-01-25,NaN,0,0.00,False,New
3,4,Sierra,Anderson,sierra.anderson4@example.com,(244) 947-8527,Phoenix,TX,79615,USA,2022-03-22,2023-02-06,20,4473.08,False,VIP
4,5,Devon,Moore,devon.moore5@example.com,(921) 271-1750,Charlotte,IL,40458,USA,2022-08-27,2023-03-09,9,1118.56,True,Active

In [3]:
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 75 entries, 0 to 74
Data columns (total 15 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   customer_id       75 non-null     int64
 1   first_name        75 non-null     object
 2   last_name         75 non-null     object
 3   email             75 non-null     object
 4   phone             75 non-null     object
 5   city              75 non-null     object
 6   state             75 non-null     object
 7   postal_code       75 non-null     int64
 8   country           75 non-null     object
 9   signup_date       75 non-null     object
 10  last_order_date   67 non-null     object
 11  total_orders      75 non-null     int64
 12  total_spent       75 non-null     float64
 13  marketing_opt_in  75 non-null     bool
 14  segment           75 non-null     object
dtypes: bool(1), float64(1), int64(3), object(10)
memory usage: 8.4+ KB

In [4]:
import sqlite3

customers = pd.read_csv("../01_ecommerce_ops_analytics/data/raw/customers.csv")

conn = sqlite3.connect("../01_ecommerce_ops_analytics/data/processed/ecommerce.db")

customers.to_sql("customers", conn, if_exists="replace", index=False)

75

In [10]:
import pandas as pd

inventory = pd.read_csv("../01_ecommerce_ops_analytics/data/raw/inventory.csv")

inventory.head()

   product_id  on_hand  reorder_point last_restock_date
0           1      453             73        2025-02-27
1           2      250             98        2025-07-09
2           3       16            108        2025-06-07
3           4      227             76        2025-04-28
4           5      185             32        2025-06-18

In [11]:
inventory.head()
inventory.info()
inventory.isna().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120 entries, 0 to 119
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   product_id         120 non-null    int64
 1   on_hand            120 non-null    int64
 2   reorder_point      120 non-null    int64
 3   last_restock_date  120 non-null    object
dtypes: int64(3), object(1)
memory usage: 3.9+ KB

product_id           0
on_hand              0
reorder_point        0
last_restock_date    0
dtype: int64

In [13]:
import pandas as pd

order_items = pd.read_csv("../01_ecommerce_ops_analytics/data/raw/order_items.csv")

order_items.head()

   order_id  product_id  quantity  unit_price  discount
0         1         112         2      111.90      0.00
1         1          20         3      104.44      0.15
2         1          43         4      194.97      0.00
3         1          11         1      218.49      0.00
4         1          75         4       66.25      0.15

In [14]:
order_items.head()
order_items.info()
order_items.isna().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9127 entries, 0 to 9126
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   order_id    9127 non-null   int64
 1   product_id  9127 non-null   int64
 2   quantity    9127 non-null   int64
 3   unit_price  9127 non-null   float64
 4   discount    9127 non-null   float64
dtypes: float64(2), int64(3)
memory usage: 356.7 KB

order_id      0
product_id    0
quantity      0
unit_price    0
discount      0
dtype: int64

In [6]:
import pandas as pd

orders = pd.read_csv("../01_ecommerce_ops_analytics/data/raw/orders.csv")

orders.head()

   order_id  customer_id           order_date     status
0         1          198  2025-03-24 23:54:00  delivered
1         2          331  2025-08-14 16:23:00     placed
2         3          152  2025-10-03 03:32:00  delivered
3         4          497  2025-05-30 09:48:00  delivered
4         5          447  2025-03-08 20:30:00  delivered

In [7]:
orders.head()
orders.info()
orders.isna().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000 entries, 0 to 2999
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   order_id     3000 non-null   int64
 1   customer_id  3000 non-null   int64
 2   order_date   3000 non-null   object
 3   status       3000 non-null   object
dtypes: int64(2), object(2)
memory usage: 93.9+ KB

order_id       0
customer_id    0
order_date     0
status         0
dtype: int64

In [2]:
import pandas as pd

products = pd.read_csv("../01_ecommerce_ops_analytics/data/raw/products.csv")

products.head()

   product_id        product_name     category  unit_price
0           1  Electronics Item 1  Electronics      173.31
1           2       Beauty Item 2       Beauty       36.95
2           3      Grocery Item 3      Grocery       14.82
3           4  Electronics Item 4  Electronics      176.28
4           5       Sports Item 5       Sports      210.97

In [3]:
products.head()
products.info()
products.isna().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120 entries, 0 to 119
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   product_id    120 non-null    int64
 1   product_name  120 non-null    object
 2   category      120 non-null    object
 3   unit_price    120 non-null    float64
dtypes: float64(1), int64(1), object(2)
memory usage: 3.9+ KB

product_id      0
product_name    0
category        0
unit_price      0
dtype: int64

In [5]:
import pandas as pd

returns = pd.read_csv("../01_ecommerce_ops_analytics/data/raw/returns.csv")

returns.head()

   return_id  order_id  product_id return_date         reason  refund_amount
0          1         5          14  2025-03-28     Not Needed           9.10
1          2        12          16  2025-05-08      Defective          39.23
2          3        15          31  2025-10-25  Late Delivery         463.50
3          4        20          99  2025-06-02     Wrong Item           6.31
4          5        20         106  2025-05-28        Damaged          42.22

In [6]:
returns.head()
returns.info()
returns.isna().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 371 entries, 0 to 370
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   return_id      371 non-null    int64
 1   order_id       371 non-null    int64
 2   product_id     371 non-null    int64
 3   return_date    371 non-null    object
 4   reason         371 non-null    object
 5   refund_amount  371 non-null    float64
dtypes: float64(1), int64(3), object(2)
memory usage: 17.5+ KB

return_id        0
order_id         0
product_id       0
return_date      0
reason           0
refund_amount    0
dtype: int64

In [8]:
import pandas as pd

shipments = pd.read_csv("../01_ecommerce_ops_analytics/data/raw/shipments.csv")

shipments.head()

,shipment_id,order_id,warehouse,carrier,shipped_date,delivered_date
0,1,1,CLT-03,UPS,2025-03-26 23:54:00,2025-03-28 23:54:00
1,2,3,CLT-03,FedEx,2025-10-06 03:32:00,2025-10-09 03:32:00
2,3,4,ATL-01,FedEx,2025-06-02 09:48:00,2025-06-04 09:48:00
3,4,5,ATL-01,DHL,2025-03-11 20:30:00,2025-03-14 20:30:00
4,5,6,CLT-03,USPS,2025-05-13 11:15:00,2025-05-14 11:15:00

In [9]:
shipments.head()
shipments.info()
shipments.isna().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2549 entries, 0 to 2548
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   shipment_id     2549 non-null   int64
 1   order_id        2549 non-null   int64
 2   warehouse       2549 non-null   object
 3   carrier         2549 non-null   object
 4   shipped_date    2549 non-null   object
 5   delivered_date  2093 non-null   object
dtypes: int64(2), object(4)
memory usage: 119.6+ KB

shipment_id         0
order_id            0
warehouse           0
carrier             0
shipped_date        0
delivered_date    456
dtype: int64